{"keras_version": "2.2.2", "config": [{"config": {"activation": "relu", "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "units": 512, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "batch_input_shape": [null, 784], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "rate": 0.2, "name": "dropout_1", "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "relu", "bias_constraint": null, "name": "dense_2", "units": 512, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "rate": 0.2, "name": "dropout_2", "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "bias_constraint": null, "name": "dense_3", "units": 10, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}